; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v10 ?v6)
             (pred_11 ?v11 ?v7)
             (pred_6 ?v10 ?v7)
             (pred_4 ?v1 ?v10 )
	     (pred_7 ?v10)
             (pred_8 ?v2)
             (pred_5 ?v11)
             (pred_2 ?v7)
             (pred_12 ?v10)
             (pred_3 ?v11)
             (pred_1 ?v10)
             (pred_9 ))



(:action op_5
:parameters (?v9 ?v8 ?v3 ?v13)
:precondition (and (pred_8 ?v9) (pred_8 ?v8) (pred_5 ?v3) (pred_2 ?v13)
          (pred_10 ?v9 ?v8) (pred_11 ?v3 ?v13)
                   (pred_6 ?v8 ?v13) (pred_7 ?v9) 
                   (pred_12 ?v8) (pred_3 ?v3))
:effect (and  (pred_1 ?v8) (not (pred_12 ?v8))))


(:action op_1
:parameters (?v9 ?v12)
:precondition (and (pred_8 ?v9) (pred_8 ?v12)
               (pred_7 ?v9) (pred_10 ?v9 ?v12) (pred_1 ?v12))
:effect (and (pred_7 ?v12) (not (pred_7 ?v9))))

(:action op_4
:parameters (?v9 ?v3)
:precondition (and (pred_8 ?v9) (pred_5 ?v3) 
                  (pred_7 ?v9) (pred_4 ?v3 ?v9) (pred_9 ))
:effect (and (pred_3 ?v3)
   (not (pred_4 ?v3 ?v9)) (not (pred_9 ))))


(:action op_3
:parameters (?v9 ?v4 ?v5)
:precondition (and (pred_8 ?v9) (pred_5 ?v4) (pred_5 ?v5)
                  (pred_7 ?v9) (pred_3 ?v5) (pred_4 ?v4 ?v9))
:effect (and (pred_3 ?v4) (pred_4 ?v5 ?v9)
        (not (pred_3 ?v5)) (not (pred_4 ?v4 ?v9))))

(:action op_2
:parameters (?v9 ?v3)
:precondition (and (pred_8 ?v9) (pred_5 ?v3) 
                  (pred_7 ?v9) (pred_3 ?v3))
:effect (and (pred_9 ) (pred_4 ?v3 ?v9) (not (pred_3 ?v3)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_19 obj_08 obj_15 obj_13 obj_09 obj_05 obj_16 obj_21 obj_18 obj_06 obj_02 obj_07 obj_14 obj_12 obj_04 obj_20
    obj_01 obj_17
    obj_11 obj_03 obj_10
    )

    (:init
       (pred_9)

       (pred_8 obj_19)
       (pred_8 obj_08)
       (pred_8 obj_15)
       (pred_8 obj_13)
       (pred_8 obj_09)
       (pred_8 obj_05)
       (pred_8 obj_16)
       (pred_8 obj_21)
       (pred_8 obj_18)
       (pred_8 obj_06)
       (pred_8 obj_02)
       (pred_8 obj_07)
       (pred_8 obj_14)
       (pred_8 obj_12)
       (pred_8 obj_04)
       (pred_8 obj_20)
       (pred_2 obj_01)
       (pred_2 obj_17)
       (pred_5 obj_11)
       (pred_5 obj_03)
       (pred_5 obj_10)

       (pred_10 obj_19 obj_09)
       (pred_10 obj_19 obj_08)
       (pred_10 obj_08 obj_05)
       (pred_10 obj_08 obj_15)
       (pred_10 obj_08 obj_19)
       (pred_10 obj_15 obj_16)
       (pred_10 obj_15 obj_13)
       (pred_10 obj_15 obj_08)
       (pred_10 obj_13 obj_21)
       (pred_10 obj_13 obj_15)
       (pred_10 obj_09 obj_18)
       (pred_10 obj_09 obj_05)
       (pred_10 obj_09 obj_19)
       (pred_10 obj_05 obj_06)
       (pred_10 obj_05 obj_16)
       (pred_10 obj_05 obj_08)
       (pred_10 obj_05 obj_09)
       (pred_10 obj_16 obj_02)
       (pred_10 obj_16 obj_21)
       (pred_10 obj_16 obj_15)
       (pred_10 obj_16 obj_05)
       (pred_10 obj_21 obj_07)
       (pred_10 obj_21 obj_13)
       (pred_10 obj_21 obj_16)
       (pred_10 obj_18 obj_14)
       (pred_10 obj_18 obj_06)
       (pred_10 obj_18 obj_09)
       (pred_10 obj_06 obj_12)
       (pred_10 obj_06 obj_02)
       (pred_10 obj_06 obj_05)
       (pred_10 obj_06 obj_18)
       (pred_10 obj_02 obj_04)
       (pred_10 obj_02 obj_07)
       (pred_10 obj_02 obj_16)
       (pred_10 obj_02 obj_06)
       (pred_10 obj_07 obj_20)
       (pred_10 obj_07 obj_21)
       (pred_10 obj_07 obj_02)
       (pred_10 obj_14 obj_12)
       (pred_10 obj_14 obj_18)
       (pred_10 obj_12 obj_04)
       (pred_10 obj_12 obj_06)
       (pred_10 obj_12 obj_14)
       (pred_10 obj_04 obj_20)
       (pred_10 obj_04 obj_02)
       (pred_10 obj_04 obj_12)
       (pred_10 obj_20 obj_07)
       (pred_10 obj_20 obj_04)
       (pred_12 obj_19)
       (pred_12 obj_05)
       (pred_12 obj_14)
       (pred_6  obj_19 obj_01)
       (pred_6  obj_05 obj_17)
       (pred_6  obj_14 obj_17)
       (pred_1 obj_08)
       (pred_1 obj_15)
       (pred_1 obj_13)
       (pred_1 obj_09)
       (pred_1 obj_16)
       (pred_1 obj_21)
       (pred_1 obj_18)
       (pred_1 obj_06)
       (pred_1 obj_02)
       (pred_1 obj_07)
       (pred_1 obj_12)
       (pred_1 obj_04)
       (pred_1 obj_20)

       (pred_11  obj_11 obj_01)
       (pred_11  obj_03 obj_17)
       (pred_11  obj_10 obj_17)
       (pred_4 obj_11 obj_20)
       (pred_4 obj_03 obj_18)
       (pred_4 obj_10 obj_21)
       (pred_7 obj_18)
    )

    (:goal (and
       (pred_4 obj_03 obj_08)
    ))
(:constraints
  (always (not (pred_7 obj_05)))
)
)

; plan
1. (op_4 obj_18 obj_03)
   deleted: (pred_4 obj_03 obj_18) (pred_9)
   added: (pred_3 obj_03)
   goals met: 0 of 1
2. (op_1 obj_18 obj_06)
   deleted: (pred_7 obj_18)
   added: (pred_7 obj_06)
   goals met: 0 of 1
3. (op_1 obj_06 obj_02)
   deleted: (pred_7 obj_06)
   added: (pred_7 obj_02)
   goals met: 0 of 1
4. (op_1 obj_02 obj_16)
   deleted: (pred_7 obj_02)
   added: (pred_7 obj_16)
   goals met: 0 of 1
5. (op_1 obj_16 obj_15)
   deleted: (pred_7 obj_16)
   added: (pred_7 obj_15)
   goals met: 0 of 1
6. (op_1 obj_15 obj_08)
   deleted: (pred_7 obj_15)
   added: (pred_7 obj_08)
   goals met: 0 of 1
7. (op_2 obj_08 obj_03)
   deleted: (pred_3 obj_03)
   added: (pred_9) (pred_4 obj_03 obj_08)
   goals met: 1 of 1
